SELECT k
FROM (
select t.*
from (SELECT  [Тип звонка]
      ,[Клиент] k
      ,[Сотрудник]
      ,[Должность]
      ,[Через]
      ,[Переадресация]
      ,[Дата]
      ,[Время]
      ,[Ожидание]
      ,[Длительность]
  FROM [bdpeople].[dbo].[Sheet1$]
WHERE [Тип звонка] = 'неотвеченный' 
--AND Сотрудник = 'взрослая поликлиника' 
AND Время BETWEEN '18991230 08:00:00' AND '18991230 11:00:38'
AND Дата >= '20220207') AS t

LEFT JOIN (SELECT  [Тип звонка]
      ,[Клиент]
      ,[Сотрудник]
      ,[Должность]
      ,[Через]
      ,[Переадресация]
      ,[Дата]
      ,[Время]
      ,[Ожидание]
      ,[Длительность]
  FROM [bdpeople].[dbo].[Sheet1$]
WHERE [Тип звонка] = 'входящий' 
--AND Сотрудник = 'взрослая поликлиника' 
AND Дата >= '20220207'  )  AS t1 ON t1.Клиент = t.k AND t1.Время > t.Время AND t1.Дата = t.Дата

WHERE t1.[Тип звонка] IS NULL --OR -- AND t1.Время > t.Время
) AS tt
GROUP BY k


-----Выборка по списку детально

SELECT t2.*
FROM (

SELECT k
FROM (
select t.*
from (SELECT  [Тип звонка]
      ,[Клиент] k
      ,[Сотрудник]
      ,[Должность]
      ,[Через]
      ,[Переадресация]
      ,[Дата]
      ,[Время]
      ,[Ожидание]
      ,[Длительность]
  FROM [bdpeople].[dbo].[Sheet1$]
WHERE [Тип звонка] = 'неотвеченный' 
--AND Сотрудник = 'взрослая поликлиника' 
AND Время BETWEEN '18991230 08:00:00' AND '18991230 11:00:38'
AND Дата >= '20220207') AS t

LEFT JOIN (SELECT  [Тип звонка]
      ,[Клиент]
      ,[Сотрудник]
      ,[Должность]
      ,[Через]
      ,[Переадресация]
      ,[Дата]
      ,[Время]
      ,[Ожидание]
      ,[Длительность]
  FROM [bdpeople].[dbo].[Sheet1$]
WHERE [Тип звонка] = 'входящий' 
--AND Сотрудник = 'взрослая поликлиника' 
AND Дата >= '20220207'  )  AS t1 ON t1.Клиент = t.k AND t1.Время > t.Время AND t1.Дата = t.Дата

WHERE t1.[Тип звонка] IS NULL --OR -- AND t1.Время > t.Время
) AS tt
)   AS t1
JOIN (SELECT  [Тип звонка]
      ,[Клиент] k
      ,[Сотрудник]
      ,[Должность]
      ,[Через]
      ,[Переадресация]
      ,[Дата]
      ,[Время]
      ,[Ожидание]
      ,[Длительность]
  FROM [bdpeople].[dbo].[Sheet1$]) AS t2 ON t2.k = t1.k
  
ORDER BY k, t2.Время DESC