--SELECT  t.nam_mok, t.VID_VME,  COUNT(*) AS [кол-во]
--FROM (
	Select distinct
	--s.iddokt,u.CODE_MD
		sch.SchetType as [Тип счета],sch.id as schet_id,sch.month, zs.NPR_DATE, zs.NPR_MO, f003.nam_mok
	,sch.month as [Месяц]
		,sch.YEAR[Год]
		,case when p.smo like '46%' then p.smo else '46' end as [Плательщик]
		, p.SMO as [Страховая компания]
		, p.fam,p.im,isnull(p.ot,'') ot
		,p.W as [Пол]
		,p.DR 
		, convert(nvarchar(150),(case when p.DOCTYPE=14  then 'Паспорт РФ'
		when p.DOCTYPE=3 then 'Св-во о рождении'
		else doc.DocName end)) + ' ' + convert(nvarchar,(p.DOCSER)) + ' ' + convert(nvarchar,(p.DOCNUM)) as [Данные документа удостоверяющего личность]
		, p.NPOLIS as [Полис]
		, p.SNILS as [Снилс]
		, zs.DATE_Z_1 [дата начала]
		, zs.DATE_Z_2 
		-- , zs.VIDPOM as [Вид помощи]
		--, zs.USL_OK as [Условия оказания мед. помощи],

		--zs.id, zs.SUMV as [Стоимость оказанной мед. помощи]
		--,zs.RSLT AS [Результат]
		--, zs.ISHOD
		-- ,zs.PR_NOV [признак переподачи]
		--, count (u.id)
	-- , cast(u.id as varchar) + ','
	,u.code_usl
	,ms.name  [рег именование]
	-- , s.iddokt, u.CODE_MD
	--,zs.ishod
		,u.VID_VME
	, y.name [фед] 
	--,ms.tarif [tarif по справочнику],u.tarif [tarif в услуге], ms.profil, ms.prvs, ms.for_pom, ms.ishod, ms.rslt--, ms.p_cel25
	-- ms.idsp
		--,zs.d3_scid
		--,p.d3_scid
		--,idsp
		-- , sump, oplata, u.*
		-- , s.NHISTORY as [Номер истории]
		--, s.PODR as [Подразделение]

	FROM [D3_SCHET_OMS] sch                  
		inner join D3_PACIENT_OMS p on p.d3_scid=sch.id
		inner join D3_ZSL_OMS zs on zs.D3_PID=p.id AND sch.code_mo=460061 
		--AND sch.month<3
		AND sch.YEAR=2022  
		and sch.id in (8905, 8909, 8913, 8916, 9025, 9068)			--реестр подан
		join D3_SL_OMS s on s.D3_ZSLID=zs.ID 
		JOIN D3_USL_OMS u ON u.D3_SLID=s.id


	join V009 rz on rz.IDRMP=zs.RSLT
	left join F011 doc on doc.Id=p.DOCTYPE
	LEFT JOIN f003 ON f003.mcod=zs.NPR_MO
	--WHERE iddokt is  NULL --AND sch.SchetType LIKE 'H'
	--WHERE (ds1 NOT BETWEEN 'C00' AND 'D09.z') and ds1 NOT BETWEEN 'D45' AND 'D47.z'
	JOIN medicalServices AS ms ON ms.code_usl=u.CODE_USL AND u.DATE_IN >=ms.dataBegin AND u.DATE_OUT<=ISNULL(ms.dataEnd,'20991231') AND ms.code_usl  BETWEEN 'R01.001.008' AND 'R01.001.036'
	left join Yamed_Spr_UslCode y on y.ID=u.vid_vme
	--WHERE ms.name LIKE '27%' 
	/*and p.fam = 'Шадрин'*/
--) t 
WHERE (f003.nam_mok = 'ОБУЗ "ГОРШЕЧЕНСКАЯ ЦРБ"' AND u.VID_VME IN ('A09.05.010','A09.05.017','A09.05.018','A09.05.020','A09.05.021','A09.05.022','A09.05.023','A09.05.025','A09.05.026','A09.05.030',
																'A09.05.031','A09.05.032','A09.05.041','A09.05.042','A09.05.046','A09.05.051.001','A12.05.027','A12.05.039'))
OR (f003.nam_mok = 'ОБУЗ "КАСТОРЕНСКАЯ ЦРБ"' AND u.VID_VME IN ('A09.05.007', 'A09.05.020', 'A09.05.023', 'A09.05.063', 'A09.05.065', 'A09.05.202'))			
OR (f003.nam_mok = 'ОБУЗ "КОНЫШЕВСКАЯ ЦРБ"' AND u.VID_VME IN ('A09.05.004', 'A09.05.007', 'A09.05.009', 'A09.05.010', 'A09.05.017', 'A09.05.018', 'A09.05.020', 'A09.05.021',
																'A09.05.022', 'A09.05.023', 'A09.05.025', 'A09.05.026', 'A09.05.028', 'A09.05.041', 'A09.05.042', 'A09.05.063',
																'A09.05.065', 'A09.05.083', 'A09.05.202', 'A12.06.045', 'A12.30.014',  'B03.016.003', 'B03.016.006'))	OR
 (f003.nam_mok = 'ОБУЗ "КУРСКАЯ ГОРБОЛЬНИЦА №2"' AND u.VID_VME IN ('A09.05.004', 'A09.05.007','A09.05.009','A09.05.010','A09.05.011','A09.05.017','A09.05.018','A09.05.020','A09.05.021','A09.05.022',
'A09.05.022.001','A09.05.023','A09.05.025','A09.05.026','A09.05.028','A09.05.030','A09.05.031','A09.05.032','A09.05.039','A09.05.041','A09.05.042','A09.05.044','A09.05.045','A09.05.046','A09.05.050',
'A09.05.051.001','A09.05.063','A09.05.065','A09.05.083','A09.05.130','A12.05.027','A12.05.039','A12.06.019','A26.05.016.001','A26.06.033','A26.06.036','A26.06.041','A26.30.004.001','B03.016.003','B03.016.006'))	

OR 

(f003.nam_mok = 'ОБУЗ "КУРСКАЯ ГОРБОЛЬНИЦА №3"' AND u.VID_VME IN ('A08.16.007', 'A08.18.002','A08.19.003','A09.05.004','A09.05.007','A09.05.009','A09.05.010','A09.05.011','A09.05.017','A09.05.018','A09.05.020',
'A09.05.021','A09.05.022','A09.05.022.001','A09.05.023','A09.05.025','A09.05.026','A09.05.028','A09.05.030','A09.05.031','A09.05.032','A09.05.034','A09.05.041','A09.05.042','A09.05.044','A09.05.045','A09.05.046',
'A09.05.050','A09.05.051.001','A09.05.061','A09.05.063','A09.05.065','A09.05.083','A09.05.130','A09.05.135','A09.19.001','A09.28.027','A12.05.005','A12.05.039','A12.06.019','A12.20.001','A12.30.014','A26.01.017',
'A26.05.016.001','A26.06.032','A26.06.033','A26.06.036','A26.06.041','A26.06.081.001','A26.06.081.002','A26.19.010','A26.19.011','A26.30.004.001','A26.30.004.004','B03.016.002','B03.016.003','B03.016.006','B03.016.010'))	

OR (f003.nam_mok = 'ОБУЗ "КУРСКАЯ ГОРОДСКАЯ БОЛЬНИЦА № 6"' AND u.VID_VME IN ('A09.05.010', 'A09.05.017', 'A09.05.020', 'A09.05.021', 'A09.05.023', 'A09.05.026', 'A09.05.041', 'A09.05.051.001', 
'A12.20.001', 'A26.30.004.001', 'B03.016.003'))	
OR (f003.nam_mok = 'ОБУЗ "КУРСКАЯ ГОРОДСКАЯ ПОЛИКЛИНИКА №5"' AND u.VID_VME IN ('A08.20.017') )	
	
OR (f003.nam_mok = 'ОБУЗ "КУРСКАЯ ЦРБ"' AND u.VID_VME IN ('A09.05.004', 'A09.05.007', 'A09.05.009','A09.05.010','A09.05.011','A09.05.017','A09.05.018','A09.05.020','A09.05.021','A09.05.022','A09.05.022.001',
'A09.05.023','A09.05.025','A09.05.026','A09.05.028','A09.05.030','A09.05.031','A09.05.032','A09.05.034','A09.05.039','A09.05.041','A09.05.042','A09.05.043','A09.05.044','A09.05.045','A09.05.046','A09.05.050',
'A09.05.051.001','A09.05.058','A09.05.061','A09.05.063','A09.05.065','A09.05.078','A09.05.083','A09.05.117','A09.05.130','A09.05.135','A09.05.202','A09.19.001','A09.28.027','A11.19.011.001','A12.05.005',
'A12.05.006','A12.05.039','A12.06.017','A12.06.019','A12.06.045','A12.09.012','A12.20.001','A12.30.014','A26.05.016.001,''A26.05.019.001','A26.05.020.001','A26.06.033','A26.06.036','A26.06.041','A26.06.041.002',
'A26.19.010','A26.30.004.001','A26.30.004.004','B03.016.002','B03.016.003','B03.016.006') )	
OR (f003.nam_mok = 'ОБУЗ "КУРЧАТОВСКАЯ ЦРБ"' AND u.VID_VME IN ('A09.05.004', 'A09.05.009', 'A09.05.010','A09.05.017','A09.05.018','A09.05.020','A09.05.021','A09.05.023','A09.05.025','A09.05.026','A09.05.028',
'A09.05.041','A09.05.042','A09.05.045','A09.05.046','A09.05.063','A09.05.083','A12.06.019','A12.20.001','A26.19.010','B03.016.003','B03.016.006') )
OR (f003.nam_mok = 'ОБУЗ "МЕДВЕНСКАЯ ЦРБ"' AND u.VID_VME IN ('A09.05.004', 'A09.05.007','A09.05.009','A09.05.010','A09.05.017','A09.05.020','A09.05.021','A09.05.022','A09.05.022.001','A09.05.023','A09.05.025',
'A09.05.026','A09.05.028','A09.05.030','A09.05.031','A09.05.032','A09.05.034','A09.05.039','A09.05.041','A09.05.042','A09.05.045','A09.05.050','A12.05.039','A12.30.014','A26.06.033','A26.06.036','A26.06.041','B03.016.003') )
OR (f003.nam_mok = 'ОБУЗ "ОКТЯБРЬСКАЯ ЦРБ"' AND u.VID_VME IN ('A09.05.004', 'A09.05.009','A09.05.010','A09.05.017','A09.05.018','A09.05.020','A09.05.021','A09.05.022','A09.05.023','A09.05.025','A09.05.026',
'A09.05.028','A09.05.030','A09.05.031','A09.05.032','A09.05.041','A09.05.042','A09.05.044','A09.05.045','A09.05.046','A09.05.050','A09.05.051.001','A09.05.056','A09.05.063','A09.05.065','A09.05.083',
'A09.05.130','A09.05.202','A09.19.001','A12.05.005','A12.05.006','A12.05.039','A12.06.019','A12.06.045','A26.06.033','A26.06.036','A26.06.041','A26.06.071.001','A26.06.071.002','B03.016.003','B03.016.006') )	

OR (f003.nam_mok = 'ОБУЗ "СОВЕТСКАЯ ЦРБ"' AND u.VID_VME IN ('A09.05.007', 'A09.05.063','A09.05.065','A09.05.083','A09.05.130') )	

OR (f003.nam_mok = 'ОБУЗ "ЧЕРЕМИСИНОВСКАЯ ЦРБ"' AND u.VID_VME IN ('A08.20.017.001') )																						
--GROUP BY t.nam_mok, t.VID_VME
--ORDER BY t.nam_mok, t.VID_VME